run/spotWeld/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (solid liquid gas);

solid 
{
    type            pureStaticSolidPhaseModel;
}

liquid
{
    type            pureMovingPhaseModel;
}

gas
{
    type            pureMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            temperatureDependent;
        sigma           
        {
            type    table;
            values
            (
                (1933 1.493)
                (3133 1.265)
            );
            outOfBounds         clamp;
            interpolationScheme linear;
        }
    }
    (gas and solid)
    {
        type            temperatureDependent;
        sigma           
        {
            type    table;
            values
            (
                (1933 1.493)
                (3133 1.265)
            );
            outOfBounds         clamp;
            interpolationScheme linear;
        }
    }
    (solid and liquid)
    {
        type            constant;
        sigma           0.0;
    }
);

interfacePorous
(
    (solid and liquid)
    {
        type            VollerPrakash;
        solidPhase      alpha.solid;
        Cu              1.5e+6;
    }
);


massTransferModel
(
    (solid to liquid)
    {
        type            Lee;
        C               3.25e+6;
        Tactivate       1933;
    }
    (liquid to solid)
    {
        type            Lee;
        C               -0.75e+5;
        Tactivate       1933;
    }
);


// ************************************************************************* //
