run/spotWeld/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    zmax
    {
        type            patch;
        nFaces          50;
        startFace       4900;
    }
    xmax
    {
        type            patch;
        nFaces          50;
        startFace       4950;
    }
    zmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5000;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2500;
        startFace       5050;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2500;
        startFace       7550;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       10050;
    }
)

// ************************************************************************* //
