run/spotWeld/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   3e-4;

vertices
(
    (0 0 0)
    (0.9998 -0.01745 0)
    (0.9998 0.01745 0)
    (0 0 1)
    (0.9998 -0.01745 1)
    (0.9998 0.01745 1)
);

blocks
(
    hex (0 1 2 0 3 4 5 3) (50 1 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    zmax
    {
        type patch;
        faces
        (
            (3 4 5 3)
        );
    }
    xmax
    {
        type patch;
        faces
        (
            (1 2 5 4)
        );
    }
    zmin
    {
        type wall;
        faces
        (
            (0 1 2 0)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (3 5 2 0)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //